alex-jegers/CANgauge/drivers/stm32_lcd-DESKTOP-J7IR68I.c
/*
 * stm32_lcd.c
 *
 *  Created on: Feb 17, 2024
 *      Author: awjpp
 */

#ifdef CORE_CM7

#include "stm32_lcd.h"
#include "stm32_rcc.h"		//For enabling PLL clock.
#include "stm32_io.h"		//For controlling IO related to the lcd.
#include "stm32_dma2d.h"	//For frame buffer control.
#include "stm32_timer.h"	//For lcd backlight PWM.
#include "stm32_spi.h"		//For initializing the ST7701 driver used on CANgauge config.

/*******STATIC VARIABLES************/
static lv_disp_drv_t* lcd_flush_rdy_disp_drv;

/*******	STATIC FUNCTION DECLARATIONS	************/
static void lcd_lvgl_disp_flush(lv_disp_drv_t * disp_drv,
								const lv_area_t * area, lv_color_t * color_p);
static void lcd_lvgl_flush_complete();
static void disp_clean_dcache(lv_disp_drv_t *drv);
static void lcd_st7701_init();
static void lcd_st7701_send_cmd(uint8_t cmd, bool hold_ss_low);
static void lcd_st7701_send_param(uint8_t param, bool hold_ss_low);
static void lcd_st7701_read_param(uint32_t* data, bool hold_ss_low);
static bool lcd_st7701_check_id();
static uint8_t lcd_st7701_self_diag();

/*TODO: Rename these and combine into 1 once i figure out whats broken*/
static void lcd_st7701_my_spi_config();
static void lcd_st7701_adafruit_spi_config();

/*******		STATIC FUNCTION DEFINITIONS		********/
static void lcd_lvgl_disp_flush(lv_disp_drv_t * disp_drv, const lv_area_t * area, lv_color_t * color_p)
{
    uint32_t start_addr = (area->y1 * LTDC_SCREEN_SIZE_X_px * LTDC_BYTES_PER_PIXEL) + (area->x1 * LTDC_BYTES_PER_PIXEL);
    start_addr += LTDC_DISP_BUFFER_ADDR;

    uint32_t x_size = lv_area_get_width(area);
    uint32_t y_size = lv_area_get_height(area);

	dma2d_start_copy((void*)color_p, (void*)start_addr, x_size, y_size);
}

static void lcd_lvgl_flush_complete()
{
	lv_disp_flush_ready(lcd_flush_rdy_disp_drv);
}

static void disp_clean_dcache(lv_disp_drv_t *drv)
{
	SCB_CleanInvalidateDCache();
}

static void lcd_st7701_init()
{
#ifdef TARGET_HARDWARE_CANGAUGE

	//Hardware reset.
	io_set_pin_dir_out(LTDC_RESET_io);
	io_pin_out_clr(LTDC_RESET_io);
	timer_delay_ms(10);
	io_pin_out_set(LTDC_RESET_io);
	timer_delay_ms(200);

	//Enable SPI.
	spi4_enable_clocks();
	spi4_enable_io();
	spi_set_sck_div(SPI4, SPI_SCK_DIV_256);
	spi_init(SPI4);
	spi_enable(SPI4);

	lcd_st7701_adafruit_spi_config();

#endif //TARGET_HARDWARE_CANGAUGE
}

static void lcd_st7701_send_cmd(uint8_t cmd, bool hold_ss_low)
{
#ifdef TARGET_HARDWARE_CANGAUGE
	uint16_t full_cmd = 0x0000;
	full_cmd |= cmd;
	spi_tx(SPI4, full_cmd, 9, hold_ss_low);
#endif
}

static void lcd_st7701_send_param(uint8_t param, bool hold_ss_low)
{
#ifdef TARGET_HARDWARE_CANGAUGE
	uint16_t full_param = 0x0100;
	full_param |= param;
	spi_tx(SPI4, full_param, 9, hold_ss_low);
#endif
}

static void lcd_st7701_read_param(uint32_t* data, bool hold_ss_low)
{
#ifdef TARGET_HARDWARE_CANGAUGE
	spi_rx(SPI4, data, 8, hold_ss_low);
#endif
}

static bool lcd_st7701_check_id()
{
#ifdef TARGET_HARDWARE_CANGAUGE
	static uint32_t full_id, id1, id2, id3 = 0;
	spi_tx(SPI4, ST7701_RDDID_CMD, 9, true);
	spi_rx(SPI4, &id1, 8, true);
	spi_rx(SPI4, &id2, 8, true);
	spi_rx(SPI4, &id3, 8, false);

	full_id = id1 | (id2 << 8) | (id3 << 16);

	if (full_id != 0x00ffff7f)
	{
		return false;
	}
	return true;
#endif	//TARGET_HARDWARE_CANGAUGE
}

static uint8_t lcd_st7701_self_diag()
{
#ifdef TARGET_HARDWARE_CANGAUGE
	static uint32_t self_diag;
	lcd_st7701_send_cmd(ST7701_RDDSDR_CMD, true);
	lcd_st7701_read_param(&self_diag, false);
	self_diag &= ST7701_RDDSDR_PARAM;
	return self_diag;
#endif
}

static void lcd_st7701_my_spi_config()
{
	uint8_t self_diag = lcd_st7701_self_diag();
	if (self_diag != 0)
	{
		while (1)
		{
			io_test_led_on();
			timer_delay_ms(500);
			io_test_led_off();
			timer_delay_ms(500);
		}
	}

	//Software reset.
	lcd_st7701_send_cmd(ST7701_SWRESET_CMD, false);		//SW reset.
	timer_delay_ms(200);

	//Read and validate the LCD ID.
	if (!lcd_st7701_check_id())
	{
		//TODO: Call error handler here.
		while (1)
		{
			io_test_led_on();
			timer_delay_ms(500);
			io_test_led_off();
			timer_delay_ms(500);
		}
	}

	/*Sleep out.*/
	lcd_st7701_send_cmd(ST7701_SLPOUT_CMD, false);

	/*Display on.*/
	lcd_st7701_send_cmd(ST7701_DISPON_CMD, false);

	//Enable BK0 function of command 2.
	lcd_st7701_send_cmd(ST7701_CND2BKxSEL_CMD, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_PARAM1, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_PARAM2, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_PARAM3, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_PARAM4, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_ENABLE_BK0, false);

	//Display line setting.
	lcd_st7701_send_cmd(0xC0, true);
	lcd_st7701_send_param(0x3B, true);
	lcd_st7701_send_param(0x00, false);

	//Porch control.
	lcd_st7701_send_cmd(0xC1, true);
	lcd_st7701_send_param(0x0B, true);
	lcd_st7701_send_param(0x02, false);

	//Inversion selection and frame rate control.
	lcd_st7701_send_cmd(0xC2, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x02, false);

	//RGB control.
	lcd_st7701_send_cmd(0xC3, true);
	lcd_st7701_send_param(0x00, false);

	//Color control.
	lcd_st7701_send_cmd(0xCD, true);
	lcd_st7701_send_param(0x08, false);

	//Positive gamma control.
	lcd_st7701_send_cmd(0xB0, true);
	lcd_st7701_send_param(0x02, true);
	lcd_st7701_send_param(0x13, true);
	lcd_st7701_send_param(0x1B, true);
	lcd_st7701_send_param(0x0D, true);
	lcd_st7701_send_param(0x10, true);
	lcd_st7701_send_param(0x05, true);
	lcd_st7701_send_param(0x08, true);
	lcd_st7701_send_param(0x07, true);
	lcd_st7701_send_param(0x07, true);
	lcd_st7701_send_param(0x24, true);
	lcd_st7701_send_param(0x04, true);
	lcd_st7701_send_param(0x11, true);
	lcd_st7701_send_param(0x0E, true);
	lcd_st7701_send_param(0x2C, true);
	lcd_st7701_send_param(0x33, true);
	lcd_st7701_send_param(0x1D, false);

	//Negative gamma control.
	lcd_st7701_send_cmd(0xB1, true);
	lcd_st7701_send_param(0x05, true);
	lcd_st7701_send_param(0x13, true);
	lcd_st7701_send_param(0x1B, true);
	lcd_st7701_send_param(0x0D, true);
	lcd_st7701_send_param(0x10, true);
	lcd_st7701_send_param(0x05, true);
	lcd_st7701_send_param(0x08, true);
	lcd_st7701_send_param(0x07, true);
	lcd_st7701_send_param(0x07, true);
	lcd_st7701_send_param(0x24, true);
	lcd_st7701_send_param(0x04, true);
	lcd_st7701_send_param(0x11, true);
	lcd_st7701_send_param(0x0E, true);
	lcd_st7701_send_param(0x2C, true);
	lcd_st7701_send_param(0x33, true);
	lcd_st7701_send_param(0x1D, false);

	//Enable BK1 function of command 2.
	lcd_st7701_send_cmd(ST7701_CND2BKxSEL_CMD, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_PARAM1, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_PARAM2, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_PARAM3, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_PARAM4, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_ENABLE_BK1, false);

	//VOP amplitude setting.
	lcd_st7701_send_cmd(0xB0, true);
	lcd_st7701_send_param(0x5D, false);

	//VCOM amplitude setting.
	lcd_st7701_send_cmd(0xB1, true);
	lcd_st7701_send_param(0x43, false);

	//VGH voltage setting.
	lcd_st7701_send_cmd(0xB2, true);
	lcd_st7701_send_param(0x81, false);

	//VGL voltage setting.
	lcd_st7701_send_cmd(0xB5, true);
	lcd_st7701_send_param(0x43, false);

	//Power control 1.
	lcd_st7701_send_cmd(0xB7, true);
	lcd_st7701_send_param(0x85, false);

