alex-jegers/CANgauge/drivers/stm32_lcd-DESKTOP-J7IR68I.c
	//Power control 2.
	lcd_st7701_send_cmd(0xB8, true);
	lcd_st7701_send_param(0x20, false);

	//Source pre drive timing set 1.
	lcd_st7701_send_cmd(0xC1, true);
	lcd_st7701_send_param(0x78, false);

	//Source EQ2 setting.
	lcd_st7701_send_cmd(0xC2, true);
	lcd_st7701_send_param(0x78, false);

	//MIPI setting 1.
	//lcd_st7701_send_cmd(0xD0, true);
	//lcd_st7701_send_param(0x88, false);

	//Sunlight readable enhancement.
	//lcd_st7701_send_cmd(0xE0, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x02, false);

	//Noise reduce control.
	//lcd_st7701_send_cmd(0xE1, true);
	//lcd_st7701_send_param(0x03, true);
	//lcd_st7701_send_param(0xA0, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x04, true);
	//lcd_st7701_send_param(0xA0, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x20, true);
	//lcd_st7701_send_param(0x20, false);

	//Sharpness control.
	//lcd_st7701_send_cmd(0xE2, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, false);

	//Color calibration control.
	//lcd_st7701_send_cmd(0xE3, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x00, true);
	//lcd_st7701_send_param(0x11, true);
	//lcd_st7701_send_param(0x00, false);

	//Skin tone preservation control.
	//lcd_st7701_send_cmd(0xE4, true);
	//lcd_st7701_send_param(0x22, true);
	//lcd_st7701_send_param(0x00, false);

	//Disable BKx function of command 2.
	lcd_st7701_send_cmd(ST7701_CND2BKxSEL_CMD, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_PARAM1, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_PARAM2, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_PARAM3, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_PARAM4, true);
	lcd_st7701_send_param(ST7701_CND2BKxSEL_DISABLE, false);

	/*MADCTL*/
	lcd_st7701_send_cmd(ST7701_MADCTL_CMD, true);
	lcd_st7701_send_cmd(ST7701_MADCTL_ML_NORMAL_SCAN | ST7701_MADCTL_BGR_RGB, false);

	/*COLMOD*/
	lcd_st7701_send_cmd(ST7701_COLMOD_CMD, true);
	lcd_st7701_send_cmd(ST7701_COLMOD_VIPF_18BPP, false);

	//All pixels on.
	lcd_st7701_send_cmd(ST7701_ALLPON_CMD, false);

	//Read back the power mode.
	static uint32_t power_mode;
	lcd_st7701_send_cmd(ST7701_RDDPM_CMD, true);
	lcd_st7701_read_param(&power_mode, false);
	if (power_mode != ST7701_RDDPM_PARAM)
	{
		while (1)
		{
			io_test_led_on();
			timer_delay_ms(500);
			io_test_led_off();
			timer_delay_ms(500);
		}
	}

	//Read and check the self diagnostic register.
	self_diag = 0x00;
	self_diag = lcd_st7701_self_diag();
	if (self_diag != ST7701_RDDSDR_PARAM)
	{
		while (1)
		{
			io_test_led_on();
			timer_delay_ms(500);
			io_test_led_off();
			timer_delay_ms(500);
		}
	}
}

static void lcd_st7701_adafruit_spi_config()
{
	/*NOTES:
	 * - Operating in "DE mode".
	 *
	 */
	lcd_st7701_send_cmd(0x01, false);		//Software reset.

	lcd_st7701_send_cmd(0xFF, true);		//Command2 BKx Selection
	lcd_st7701_send_param(0x77, true);		//Nothing.
	lcd_st7701_send_param(0x01, true);		//Nothing.
	lcd_st7701_send_param(0x00, true);		//Nothing.
	lcd_st7701_send_param(0x00, true);		//Nothing.
	lcd_st7701_send_param(0x10, false);		//Selects and enables BK0.


	lcd_st7701_send_cmd(0xC0, true);		//Display line setting (LNESET).
	lcd_st7701_send_param(0x3B, true);		//0b0011 1011, display line setting = 59, no extra line.
	lcd_st7701_send_param(0x00, false);		//No delta line.


	lcd_st7701_send_cmd(0xC1, true);		//Porch control (PORCTRL)
	lcd_st7701_send_param(0x0B, true);		//Vertical back porch = 12.
	lcd_st7701_send_param(0x02, false);		//Vertical front porch = 2.

	lcd_st7701_send_cmd(0xC2, true);		//Inversion and frame rate control.
	lcd_st7701_send_param(0x00, true);		//"1 dot inversion"
	lcd_st7701_send_param(0x02, false);		//Sets minimum number of PCLK per line to 2.

	lcd_st7701_send_cmd(0xCC, true);		//THIS IS NOT IN THE DATASHEET????
	lcd_st7701_send_param(0x10, false);

	lcd_st7701_send_cmd(0xCD, true);		//Color control (COLCTRL)
	lcd_st7701_send_param(0x08, false);		//Pixel collect to DB[17:0] (see table 17), copy self MSB.

	lcd_st7701_send_cmd(0xB0, true);		//Positive voltage gamma control.
	lcd_st7701_send_param(0x02, true);
	lcd_st7701_send_param(0x13, true);
	lcd_st7701_send_param(0x1B, true);
	lcd_st7701_send_param(0x0D, true);
	lcd_st7701_send_param(0x10, true);
	lcd_st7701_send_param(0x05, true);
	lcd_st7701_send_param(0x08, true);
	lcd_st7701_send_param(0x07, true);
	lcd_st7701_send_param(0x07, true);
	lcd_st7701_send_param(0x24, true);
	lcd_st7701_send_param(0x04, true);
	lcd_st7701_send_param(0x11, true);
	lcd_st7701_send_param(0x0E, true);
	lcd_st7701_send_param(0x2C, true);
	lcd_st7701_send_param(0x33, true);
	lcd_st7701_send_param(0x1D, false);

	lcd_st7701_send_cmd(0xB1, true);		//Negative voltage gamma control.
	lcd_st7701_send_param(0x05, true);
	lcd_st7701_send_param(0x13, true);
	lcd_st7701_send_param(0x1B, true);
	lcd_st7701_send_param(0x0D, true);
	lcd_st7701_send_param(0x11, true);
	lcd_st7701_send_param(0x05, true);
	lcd_st7701_send_param(0x08, true);
	lcd_st7701_send_param(0x07, true);
	lcd_st7701_send_param(0x07, true);
	lcd_st7701_send_param(0x24, true);
	lcd_st7701_send_param(0x04, true);
	lcd_st7701_send_param(0x11, true);
	lcd_st7701_send_param(0x0E, true);
	lcd_st7701_send_param(0x2C, true);
	lcd_st7701_send_param(0x33, true);
	lcd_st7701_send_param(0x1D, false);

	lcd_st7701_send_cmd(0xFF, true);		//Command2 BKx Selection.
	lcd_st7701_send_param(0x77, true);		//Nothing.
	lcd_st7701_send_param(0x01, true);		//Nothing.
	lcd_st7701_send_param(0x00, true);		//Nothing.
	lcd_st7701_send_param(0x00, true);		//Nothing.
	lcd_st7701_send_param(0x11, false);		//Selects BK1 mode.

	lcd_st7701_send_cmd(0xB0, true);		//Vop amplitude setting.
	lcd_st7701_send_param(0x5D, false);

