alex-jegers/CANgauge/drivers/stm32_lcd-DESKTOP-J7IR68I.c
	lcd_st7701_send_cmd(0xB1, true);		//VCOM amplitude setting.
	lcd_st7701_send_param(0x43, false);

	lcd_st7701_send_cmd(0xB2, true);		//VGH voltage setting.
	lcd_st7701_send_param(0x81, false);

	lcd_st7701_send_cmd(0xB3, true);		//TEST command setting..?
	lcd_st7701_send_param(0x80, false);

	lcd_st7701_send_cmd(0xB5, true);		//VGL voltage setting.
	lcd_st7701_send_param(0x43, false);

	lcd_st7701_send_cmd(0xB7, true);		//Power control 1.
	lcd_st7701_send_param(0x85, false);

	lcd_st7701_send_cmd(0xB8, true);		//Power control 2.
	lcd_st7701_send_param(0x20, false);

	lcd_st7701_send_cmd(0xC1, true);		//Source pre drive timing set 1.
	lcd_st7701_send_param(0x78, false);

	lcd_st7701_send_cmd(0xC2, true);		//Source EQ2 setting.
	lcd_st7701_send_param(0x78, false);

	lcd_st7701_send_cmd(0xD0, true);		//MIPI setting. (why are we doing this)
	lcd_st7701_send_param(0x88, false);		//Enable EOTP report error, disable ERR pin output.

	lcd_st7701_send_cmd(0xE0, true);		//Not in datasheet???
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x02, false);

	lcd_st7701_send_cmd(0xE1, true);		//Noise reduction control.
	lcd_st7701_send_param(0x03, true);		//Disable?? and set to level 3.
	lcd_st7701_send_param(0xA0, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x04, true);
	lcd_st7701_send_param(0xA0, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x20, true);
	lcd_st7701_send_param(0x20, false);

	lcd_st7701_send_cmd(0xE2, true);		//Sharpness control.
	lcd_st7701_send_param(0x00, true);		//Disable and set level to 0.
	lcd_st7701_send_param(0x00, true);		//All below do nothing.
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, false);

	lcd_st7701_send_cmd(0xE3, true);		//Color calibration control.
	lcd_st7701_send_param(0x00, true);		//Disable.
	lcd_st7701_send_param(0x00, true);		//Nothing.
	lcd_st7701_send_param(0x11, true);		//Nothing.
	lcd_st7701_send_param(0x00, false);		//Nothing.

	lcd_st7701_send_cmd(0xE4, true);		//Skin tone preservation control.
	lcd_st7701_send_param(0x22, true);		//Enable and set mode?
	lcd_st7701_send_param(0x00, false);		//Does nothing.

	lcd_st7701_send_cmd(0xE5, true);		//Not in datasheet???
	lcd_st7701_send_param(0x05, true);
	lcd_st7701_send_param(0xEC, true);
	lcd_st7701_send_param(0xA0, true);
	lcd_st7701_send_param(0xA0, true);
	lcd_st7701_send_param(0x07, true);
	lcd_st7701_send_param(0xEE, true);
	lcd_st7701_send_param(0xA0, true);
	lcd_st7701_send_param(0xA0, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, false);

	lcd_st7701_send_cmd(0xE6, true);		//Not in datasheet???
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x11, true);
	lcd_st7701_send_param(0x00, false);

	lcd_st7701_send_cmd(0xE7, true);		//Not in datasheet???
	lcd_st7701_send_param(0x22, true);
	lcd_st7701_send_param(0x00, false);

	lcd_st7701_send_cmd(0xE8, true);		//Not in datasheet???
	lcd_st7701_send_param(0x06, true);
	lcd_st7701_send_param(0xED, true);
	lcd_st7701_send_param(0xA0, true);
	lcd_st7701_send_param(0xA0, true);
	lcd_st7701_send_param(0x08, true);
	lcd_st7701_send_param(0xEF, true);
	lcd_st7701_send_param(0xA0, true);
	lcd_st7701_send_param(0xA0, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, false);

	lcd_st7701_send_cmd(0xEB, true);		//Not in datasheet???
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x40, true);
	lcd_st7701_send_param(0x40, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, true);
	lcd_st7701_send_param(0x00, false);

	lcd_st7701_send_cmd(0xED, true);		//Not in datasheet???
	lcd_st7701_send_param(0xFF, true);
	lcd_st7701_send_param(0xFF, true);
	lcd_st7701_send_param(0xFF, true);
	lcd_st7701_send_param(0xBA, true);
	lcd_st7701_send_param(0x0A, true);
	lcd_st7701_send_param(0xBF, true);
	lcd_st7701_send_param(0x45, true);
	lcd_st7701_send_param(0xFF, true);
	lcd_st7701_send_param(0xFF, true);
	lcd_st7701_send_param(0x54, true);
	lcd_st7701_send_param(0xFB, true);
	lcd_st7701_send_param(0xA0, true);
	lcd_st7701_send_param(0xAB, true);
	lcd_st7701_send_param(0xFF, true);
	lcd_st7701_send_param(0xFF, true);
	lcd_st7701_send_param(0xFF, false);

	lcd_st7701_send_cmd(0xEF, true);		//Not in datasheet???
	lcd_st7701_send_param(0x10, true);
	lcd_st7701_send_param(0x0D, true);
	lcd_st7701_send_param(0x04, true);
	lcd_st7701_send_param(0x08, true);
	lcd_st7701_send_param(0x3F, true);
	lcd_st7701_send_param(0x1F, false);

	lcd_st7701_send_cmd(0xFF, true);		//Command2 BKx Selection.
	lcd_st7701_send_param(0x77, true);		//Nothing.
	lcd_st7701_send_param(0x01, true);		//Nothing.
	lcd_st7701_send_param(0x00, true);		//Nothing.
	lcd_st7701_send_param(0x00, true);		//Nothing.
	lcd_st7701_send_param(0x13, false);		//Selects BK3 setting.

	lcd_st7701_send_cmd(0xEF, true);		//Not in datasheet...
	lcd_st7701_send_param(0x08, false);

	lcd_st7701_send_cmd(0xFF, true);		//Command2 BKx Selection.
	lcd_st7701_send_param(0x77, true);		//Nothing.
	lcd_st7701_send_param(0x01, true);		//Nothing.
	lcd_st7701_send_param(0x00, true);		//Nothing.
	lcd_st7701_send_param(0x00, true);		//Nothing.
	lcd_st7701_send_param(0x00, false);		//Disable BK function of command 2.

	lcd_st7701_send_cmd(0x36, true);		//Display data access control. MADCTL
	lcd_st7701_send_param(0x00, false);		//Normal scan, RGB not BGR.

	lcd_st7701_send_cmd(0x3A, true);		//Interface pixel format (COLMOD).
	lcd_st7701_send_param(0x60, false);		//18 bits per pixel.

	lcd_st7701_send_cmd(0x11, false);		//Sleep out (SLPOUT).

	lcd_st7701_send_cmd(0x29, false);		//Display on (DISPON).
}


/******		GLOBAL FUNCTION DEFINITIONS		*******/
void lcd_init()
{
	//Initialize the ST7701 SPI driver.
#ifdef TARGET_HARDWARE_CANGAUGE
	io_set_output_speed(LTDC_RESET_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_pin_dir_out(LTDC_RESET_io);
	io_pin_out_clr(LTDC_RESET_io);
	lcd_st7701_init();
#endif	//TARGET_HARDWARE_CANGAUGE

	/*Enable pixel clock.*/
	rcc_enable_pll3r();

	/*Enable clock in the RCC.*/
	RCC->APB3ENR |= RCC_APB3ENR_LTDCEN;

	/*Set vertical and horizontal sync width.*/
	const uint32_t reg_vsync = LTDC_SSCR_VSYNC_HEIGHT_px - 1;
	const uint32_t reg_hsync = LTDC_SSCR_HSYNC_WIDTH_px - 1;
	LTDC->SSCR = (reg_vsync << LTDC_SSCR_VSH_Pos)
				| (reg_hsync << LTDC_SSCR_HSW_Pos);

	/*Set the vert and horz back porch.*/
	const uint32_t reg_vert_bp = LTDC_BPCR_VERT_BK_PORCH_px - 1;
	const uint32_t reg_horz_bp = LTDC_BPCR_HORZ_BK_PORCH_px - 1;
	LTDC->BPCR = (reg_vert_bp << LTDC_BPCR_AVBP_Pos)
				|(reg_horz_bp << LTDC_BPCR_AHBP_Pos);

	/*Set the active width and height.*/
	const uint32_t reg_act_height = LTDC_AWCR_ACT_HEIGHT_px - 1;
	const uint32_t reg_act_width = LTDC_AWCR_ACT_WIDTH_px - 1;
	LTDC->AWCR = (reg_act_height << LTDC_AWCR_AAH_Pos)
				| (reg_act_width << LTDC_AWCR_AAW_Pos);

	/*Set the total width and height.*/
	const uint32_t reg_tot_height = LTDC_TWCR_TOT_HEIGHT_px - 1;
	const uint32_t reg_tot_width = LTDC_TWCR_TOT_WIDTH_px - 1;
	LTDC->TWCR = (reg_tot_height << LTDC_TWCR_TOTALH_Pos)
				| (reg_tot_width << LTDC_TWCR_TOTALW_Pos);

	/*Configure synchronous signals and clock polarity.*/
	LTDC->GCR = (LTDC_GCR_DBW_Val << LTDC_GCR_DBW_Pos)
			| (LTDC_GCR_DGW_Val << LTDC_GCR_DGW_Pos)
			| (LTDC_GCR_DRW_Val << LTDC_GCR_DGW_Pos);

	/*Set the default background color.*/
	LTDC->BCCR = LTDC_BCCR_Val;


	/*Configure horizontal position.*/
	LTDC_Layer1->WHPCR = (LTDC_LxWHPCR_HORZ_START_Val << LTDC_LxWHPCR_WHSTPOS_Pos)
						| ((LTDC_LxWHPCR_HORZ_STOP_Val - 1) << LTDC_LxWHPCR_WHSPPOS_Pos);
	LTDC_Layer1->WVPCR = (LTDC_LxWVPCR_VERT_START_Val << LTDC_LxWVPCR_WVSTPOS_Pos)
						| ((LTDC_LxWVPCR_VERT_STOP_Val - 1) << LTDC_LxWVPCR_WVSPPOS_Pos);

	/*Constant alpha config register.*/
	LTDC_Layer1->CACR = LTDC_LxCACR_Val;

