alex-jegers/CANgauge/drivers/stm32_lcd-DESKTOP-J7IR68I.c
	/*Configure blending times layer factors.*/
	LTDC_Layer1->BFCR = (LTDC_LxBFCR_BF1_PXxCONST << LTDC_LxBFCR_BF1_Pos)
						| (LTDC_LxBFCR_BF2_PXxCONST << LTDC_LxBFCR_BF2_Pos);

	/*Set the buffer address.*/
	LTDC_Layer1->CFBAR = LTDC_DISP_BUFFER_ADDR;

	/*Set the buffer size registers.*/
	LTDC_Layer1->CFBLR = (LTDC_LxCFBLR_BUFFER_PITCH_Val << LTDC_LxCFBLR_CFBP_Pos)
						| (LTDC_LxCFBLR_LINE_LENGTH_Val << LTDC_LxCFBLR_CFBLL_Pos);
	LTDC_Layer1->CFBLNR = LTDC_LxCFBLNR_NUM_LINES_Val;

	/*Enable layer 1.*/
	LTDC_Layer1->CR = LTDC_LxCR_LEN;

	/*Reload the layer registers.*/
	LTDC->SRCR = LTDC_SRCR_IMR;

#ifdef TARGET_HARDWARE_CANGAUGE
	LTDC->GCR |= LTDC_GCR_PCPOL;
#endif

	/*Enable pin alternate function for all the LTDC pins.*/
	io_set_pin_mux(LTDC_RED_DATA_2_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_RED_DATA_3_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_RED_DATA_4_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_RED_DATA_5_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_RED_DATA_6_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_RED_DATA_7_io, GPIO_AFR_AF14);

	io_set_pin_mux(LTDC_GREEN_DATA_2_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_GREEN_DATA_3_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_GREEN_DATA_4_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_GREEN_DATA_5_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_GREEN_DATA_6_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_GREEN_DATA_7_io, GPIO_AFR_AF14);

	io_set_pin_mux(LTDC_BLUE_DATA_2_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_BLUE_DATA_3_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_BLUE_DATA_4_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_BLUE_DATA_5_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_BLUE_DATA_6_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_BLUE_DATA_7_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_CLK_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_HSYNC_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_VSYNC_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_DE_io, GPIO_AFR_AF14);



	/*Set the output speed to very high for all the IO lines.*/
	io_set_output_speed(LTDC_RED_DATA_2_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_RED_DATA_3_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_RED_DATA_4_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_RED_DATA_5_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_RED_DATA_6_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_RED_DATA_7_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_GREEN_DATA_2_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_GREEN_DATA_3_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_GREEN_DATA_4_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_GREEN_DATA_5_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_GREEN_DATA_6_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_GREEN_DATA_7_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_BLUE_DATA_2_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_BLUE_DATA_3_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_BLUE_DATA_4_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_BLUE_DATA_5_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_BLUE_DATA_6_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_BLUE_DATA_7_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_CLK_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_HSYNC_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_VSYNC_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_DE_io, GPIO_OSPEEDR_VERY_HIGH);

#ifdef TARGET_HARDWARE_STM32H745DISCO
	io_set_pin_mux(LTDC_RED_DATA_0_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_RED_DATA_1_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_GREEN_DATA_0_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_GREEN_DATA_1_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_BLUE_DATA_0_io, GPIO_AFR_AF14);
	io_set_pin_mux(LTDC_BLUE_DATA_1_io, GPIO_AFR_AF14);
	io_set_output_speed(LTDC_RED_DATA_0_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_RED_DATA_1_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_GREEN_DATA_0_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_GREEN_DATA_1_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_BLUE_DATA_0_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_BLUE_DATA_1_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_output_speed(LTDC_DISP_io, GPIO_OSPEEDR_VERY_HIGH);
	io_set_pin_dir_out(LTDC_DISP_io);
#endif	//TARGET_HARDWARE_STM32H745DISCO

	/*LCD backlight pin config.*/
	io_init();
	io_set_pin_dir_out(GPIOB, GPIO_PIN14_Msk);
	io_pin_out_clr(GPIOB, GPIO_PIN14_Msk);	/*TODO: Double check this PWM code.
	io_set_pin_mux(GPIOB, GPIO_PIN14_Msk, GPIO_AFR_AF2);
	timer_init(TIM12);
	timer_enable_pwm_output(TIM12, 1);
	timer_set_pwm_freq(TIM12, 1000);
	timer_set_pwm_duty_cycle(TIM12, 1000, 1);
	timer_enable(TIM12);
	*/

	/*Enable the LCD.*/
	lcd_enable();

	/*Initialize LVGL and the configure it to work with the LCD. lv_init must be called first.*/
	lv_init();
	lcd_lvgl_init();
}

/*Enables the LTDC module and the LCD screen itself.*/
void lcd_enable()
{
#ifdef TARGET_HARDWARE_STM32H745DISCO
	io_pin_out_set(LTDC_DISP_io);
#endif //TARGET_HARDWARE_STM32H745DISCO

#ifdef TARGET_HARDWARE_CANGAUGE
	io_pin_out_set(LTDC_RESET_io);
#endif	//TARGET_HARDWARE_CANGAUGE

	LTDC->GCR |= LTDC_GCR_LTDCEN;
}

void lcd_lvgl_init()
{
	/*Set up the frame buffer for lvgl */
	static lv_disp_draw_buf_t draw_buf_dsc_1;
	lv_disp_draw_buf_init(&draw_buf_dsc_1, LTDC_LVGL_BUFFER1_ADDR,
							LTDC_LVGL_BUFFER2_ADDR, LTDC_SCREEN_SIZE_X_px * LTDC_SCREEN_SIZE_Y_px);   /*Initialize the display buffer*/


	/*Link lvgl and the display driver.*/
	static lv_disp_drv_t disp_drv;                  /*Descriptor of a display driver*/
	lv_disp_drv_init(&disp_drv);                    /*Basic initialization*/

	/*IMPORTANT!!!
     *Inform the graphics library that you are ready with the flushing*/
    lcd_flush_rdy_disp_drv = &disp_drv;

	/*Set the resolution of the display*/
	disp_drv.hor_res = LTDC_SCREEN_SIZE_X_px;
	disp_drv.ver_res = LTDC_SCREEN_SIZE_Y_px;

	/*Used to copy the buffer's content to the display*/
	disp_drv.flush_cb = lcd_lvgl_disp_flush;
	disp_drv.clean_dcache_cb = disp_clean_dcache;

