alex-jegers/CANgauge/drivers/stm32_lcd-DESKTOP-J7IR68I.c
	/*Set a display buffer*/
	disp_drv.draw_buf = &draw_buf_dsc_1;

	/*Finally register the driver*/
	lv_disp_drv_register(&disp_drv);

	/*Call the flush ready function on a DMA2D transfer complete interrupt to let LVGL know were done flushing.*/
	dma2d_init(LTDC_SCREEN_SIZE_X_px, LTDC_SCREEN_SIZE_Y_px);
	dma2d_set_transfer_complete_handler(lcd_lvgl_flush_complete);
	dma2d_enable_interrupt(TRANSFER_COMPLETE);
	dma2d_nvic_enable_interrupt();
}

void lcd_solid_color_test_red()
{
	/*Enable pin alternate function for all the LTDC pins.*/
	io_set_pin_dir_out(LTDC_RED_DATA_2_io);
	io_set_pin_dir_out(LTDC_RED_DATA_3_io);
	io_set_pin_dir_out(LTDC_RED_DATA_4_io);
	io_set_pin_dir_out(LTDC_RED_DATA_5_io);
	io_set_pin_dir_out(LTDC_RED_DATA_6_io);
	io_set_pin_dir_out(LTDC_RED_DATA_7_io);
	io_set_pin_dir_out(LTDC_GREEN_DATA_2_io);
	io_set_pin_dir_out(LTDC_GREEN_DATA_3_io);
	io_set_pin_dir_out(LTDC_GREEN_DATA_4_io);
	io_set_pin_dir_out(LTDC_GREEN_DATA_5_io);
	io_set_pin_dir_out(LTDC_GREEN_DATA_6_io);
	io_set_pin_dir_out(LTDC_GREEN_DATA_7_io);
	io_set_pin_dir_out(LTDC_BLUE_DATA_2_io);
	io_set_pin_dir_out(LTDC_BLUE_DATA_3_io);
	io_set_pin_dir_out(LTDC_BLUE_DATA_4_io);
	io_set_pin_dir_out(LTDC_BLUE_DATA_5_io);
	io_set_pin_dir_out(LTDC_BLUE_DATA_6_io);
	io_set_pin_dir_out(LTDC_BLUE_DATA_7_io);

	io_pin_out_set(LTDC_RED_DATA_2_io);
	io_pin_out_set(LTDC_RED_DATA_3_io);
	io_pin_out_set(LTDC_RED_DATA_4_io);
	io_pin_out_set(LTDC_RED_DATA_5_io);
	io_pin_out_set(LTDC_RED_DATA_6_io);
	io_pin_out_set(LTDC_RED_DATA_7_io);
	io_pin_out_clr(LTDC_GREEN_DATA_2_io);
	io_pin_out_clr(LTDC_GREEN_DATA_3_io);
	io_pin_out_clr(LTDC_GREEN_DATA_4_io);
	io_pin_out_clr(LTDC_GREEN_DATA_5_io);
	io_pin_out_clr(LTDC_GREEN_DATA_6_io);
	io_pin_out_clr(LTDC_GREEN_DATA_7_io);
	io_pin_out_clr(LTDC_BLUE_DATA_2_io);
	io_pin_out_clr(LTDC_BLUE_DATA_3_io);
	io_pin_out_clr(LTDC_BLUE_DATA_4_io);
	io_pin_out_clr(LTDC_BLUE_DATA_5_io);
	io_pin_out_clr(LTDC_BLUE_DATA_6_io);
	io_pin_out_clr(LTDC_BLUE_DATA_7_io);
}

void lcd_solid_color_test_green()
{
	/*Enable pin alternate function for all the LTDC pins.*/
	io_set_pin_dir_out(LTDC_RED_DATA_2_io);
	io_set_pin_dir_out(LTDC_RED_DATA_3_io);
	io_set_pin_dir_out(LTDC_RED_DATA_4_io);
	io_set_pin_dir_out(LTDC_RED_DATA_5_io);
	io_set_pin_dir_out(LTDC_RED_DATA_6_io);
	io_set_pin_dir_out(LTDC_RED_DATA_7_io);
	io_set_pin_dir_out(LTDC_GREEN_DATA_2_io);
	io_set_pin_dir_out(LTDC_GREEN_DATA_3_io);
	io_set_pin_dir_out(LTDC_GREEN_DATA_4_io);
	io_set_pin_dir_out(LTDC_GREEN_DATA_5_io);
	io_set_pin_dir_out(LTDC_GREEN_DATA_6_io);
	io_set_pin_dir_out(LTDC_GREEN_DATA_7_io);
	io_set_pin_dir_out(LTDC_BLUE_DATA_2_io);
	io_set_pin_dir_out(LTDC_BLUE_DATA_3_io);
	io_set_pin_dir_out(LTDC_BLUE_DATA_4_io);
	io_set_pin_dir_out(LTDC_BLUE_DATA_5_io);
	io_set_pin_dir_out(LTDC_BLUE_DATA_6_io);
	io_set_pin_dir_out(LTDC_BLUE_DATA_7_io);

	io_pin_out_clr(LTDC_RED_DATA_2_io);
	io_pin_out_clr(LTDC_RED_DATA_3_io);
	io_pin_out_clr(LTDC_RED_DATA_4_io);
	io_pin_out_clr(LTDC_RED_DATA_5_io);
	io_pin_out_clr(LTDC_RED_DATA_6_io);
	io_pin_out_clr(LTDC_RED_DATA_7_io);
	io_pin_out_set(LTDC_GREEN_DATA_2_io);
	io_pin_out_set(LTDC_GREEN_DATA_3_io);
	io_pin_out_set(LTDC_GREEN_DATA_4_io);
	io_pin_out_set(LTDC_GREEN_DATA_5_io);
	io_pin_out_set(LTDC_GREEN_DATA_6_io);
	io_pin_out_set(LTDC_GREEN_DATA_7_io);
	io_pin_out_clr(LTDC_BLUE_DATA_2_io);
	io_pin_out_clr(LTDC_BLUE_DATA_3_io);
	io_pin_out_clr(LTDC_BLUE_DATA_4_io);
	io_pin_out_clr(LTDC_BLUE_DATA_5_io);
	io_pin_out_clr(LTDC_BLUE_DATA_6_io);
	io_pin_out_clr(LTDC_BLUE_DATA_7_io);
}

void lcd_solid_color_test_blue()
{
		/*Enable pin alternate function for all the LTDC pins.*/
		io_set_pin_dir_out(LTDC_RED_DATA_2_io);
		io_set_pin_dir_out(LTDC_RED_DATA_3_io);
		io_set_pin_dir_out(LTDC_RED_DATA_4_io);
		io_set_pin_dir_out(LTDC_RED_DATA_5_io);
		io_set_pin_dir_out(LTDC_RED_DATA_6_io);
		io_set_pin_dir_out(LTDC_RED_DATA_7_io);
		io_set_pin_dir_out(LTDC_GREEN_DATA_2_io);
		io_set_pin_dir_out(LTDC_GREEN_DATA_3_io);
		io_set_pin_dir_out(LTDC_GREEN_DATA_4_io);
		io_set_pin_dir_out(LTDC_GREEN_DATA_5_io);
		io_set_pin_dir_out(LTDC_GREEN_DATA_6_io);
		io_set_pin_dir_out(LTDC_GREEN_DATA_7_io);
		io_set_pin_dir_out(LTDC_BLUE_DATA_2_io);
		io_set_pin_dir_out(LTDC_BLUE_DATA_3_io);
		io_set_pin_dir_out(LTDC_BLUE_DATA_4_io);
		io_set_pin_dir_out(LTDC_BLUE_DATA_5_io);
		io_set_pin_dir_out(LTDC_BLUE_DATA_6_io);
		io_set_pin_dir_out(LTDC_BLUE_DATA_7_io);

		io_pin_out_clr(LTDC_RED_DATA_2_io);
		io_pin_out_clr(LTDC_RED_DATA_3_io);
		io_pin_out_clr(LTDC_RED_DATA_4_io);
		io_pin_out_clr(LTDC_RED_DATA_5_io);
		io_pin_out_clr(LTDC_RED_DATA_6_io);
		io_pin_out_clr(LTDC_RED_DATA_7_io);
		io_pin_out_clr(LTDC_GREEN_DATA_2_io);
		io_pin_out_clr(LTDC_GREEN_DATA_3_io);
		io_pin_out_clr(LTDC_GREEN_DATA_4_io);
		io_pin_out_clr(LTDC_GREEN_DATA_5_io);
		io_pin_out_clr(LTDC_GREEN_DATA_6_io);
		io_pin_out_clr(LTDC_GREEN_DATA_7_io);
		io_pin_out_set(LTDC_BLUE_DATA_2_io);
		io_pin_out_set(LTDC_BLUE_DATA_3_io);
		io_pin_out_set(LTDC_BLUE_DATA_4_io);
		io_pin_out_set(LTDC_BLUE_DATA_5_io);
		io_pin_out_set(LTDC_BLUE_DATA_6_io);
		io_pin_out_set(LTDC_BLUE_DATA_7_io);
}

void lcd_solid_color_test_black()
{
		/*Enable pin alternate function for all the LTDC pins.*/
		io_set_pin_dir_out(LTDC_RED_DATA_2_io);
		io_set_pin_dir_out(LTDC_RED_DATA_3_io);
		io_set_pin_dir_out(LTDC_RED_DATA_4_io);
		io_set_pin_dir_out(LTDC_RED_DATA_5_io);
		io_set_pin_dir_out(LTDC_RED_DATA_6_io);
		io_set_pin_dir_out(LTDC_RED_DATA_7_io);
		io_set_pin_dir_out(LTDC_GREEN_DATA_2_io);
		io_set_pin_dir_out(LTDC_GREEN_DATA_3_io);
		io_set_pin_dir_out(LTDC_GREEN_DATA_4_io);
		io_set_pin_dir_out(LTDC_GREEN_DATA_5_io);
		io_set_pin_dir_out(LTDC_GREEN_DATA_6_io);
		io_set_pin_dir_out(LTDC_GREEN_DATA_7_io);
		io_set_pin_dir_out(LTDC_BLUE_DATA_2_io);
		io_set_pin_dir_out(LTDC_BLUE_DATA_3_io);
		io_set_pin_dir_out(LTDC_BLUE_DATA_4_io);
		io_set_pin_dir_out(LTDC_BLUE_DATA_5_io);
		io_set_pin_dir_out(LTDC_BLUE_DATA_6_io);
		io_set_pin_dir_out(LTDC_BLUE_DATA_7_io);

		io_pin_out_clr(LTDC_RED_DATA_2_io);
		io_pin_out_clr(LTDC_RED_DATA_3_io);
		io_pin_out_clr(LTDC_RED_DATA_4_io);
		io_pin_out_clr(LTDC_RED_DATA_5_io);
		io_pin_out_clr(LTDC_RED_DATA_6_io);
		io_pin_out_clr(LTDC_RED_DATA_7_io);
		io_pin_out_clr(LTDC_GREEN_DATA_2_io);
		io_pin_out_clr(LTDC_GREEN_DATA_3_io);
		io_pin_out_clr(LTDC_GREEN_DATA_4_io);
		io_pin_out_clr(LTDC_GREEN_DATA_5_io);
		io_pin_out_clr(LTDC_GREEN_DATA_6_io);
		io_pin_out_clr(LTDC_GREEN_DATA_7_io);
		io_pin_out_clr(LTDC_BLUE_DATA_2_io);
		io_pin_out_clr(LTDC_BLUE_DATA_3_io);
		io_pin_out_clr(LTDC_BLUE_DATA_4_io);
		io_pin_out_clr(LTDC_BLUE_DATA_5_io);
		io_pin_out_clr(LTDC_BLUE_DATA_6_io);
		io_pin_out_clr(LTDC_BLUE_DATA_7_io);
}

void lcd_solid_color_test_inputs()
{
	io_set_pin_dir_in(LTDC_RED_DATA_2_io);
	io_set_pin_dir_in(LTDC_RED_DATA_3_io);
	io_set_pin_dir_in(LTDC_RED_DATA_4_io);
	io_set_pin_dir_in(LTDC_RED_DATA_5_io);
	io_set_pin_dir_in(LTDC_RED_DATA_6_io);
	io_set_pin_dir_in(LTDC_RED_DATA_7_io);
	io_set_pin_dir_in(LTDC_GREEN_DATA_2_io);
	io_set_pin_dir_in(LTDC_GREEN_DATA_3_io);
	io_set_pin_dir_in(LTDC_GREEN_DATA_4_io);
	io_set_pin_dir_in(LTDC_GREEN_DATA_5_io);
	io_set_pin_dir_in(LTDC_GREEN_DATA_6_io);
	io_set_pin_dir_in(LTDC_GREEN_DATA_7_io);
	io_set_pin_dir_in(LTDC_BLUE_DATA_2_io);
	io_set_pin_dir_in(LTDC_BLUE_DATA_3_io);
	io_set_pin_dir_in(LTDC_BLUE_DATA_4_io);
	io_set_pin_dir_in(LTDC_BLUE_DATA_5_io);
	io_set_pin_dir_in(LTDC_BLUE_DATA_6_io);
	io_set_pin_dir_in(LTDC_BLUE_DATA_7_io);
}


#endif //CORE_CM7
